In [1]:
import pandas as pd
import os

In [2]:
base_path = '../dataset'

original_data = os.path.join(base_path, 'original_data')
processed_data = os.path.join(base_path, 'processed_data')

In [3]:
features=pd.read_csv(os.path.join(processed_data, "item_features_mapped.csv"))

In [4]:
features["value"]=1

In [5]:
len(features)

471751

In [6]:
features.head()

   item_id  feature_category_id  feature_value_id  value
0    19021                   56               365      1
1    19021                   62               801      1
2    19021                   68               351      1
3    19021                   33               802      1
4    19021                   72                75      1

In [7]:
feat_categories=features["feature_category_id"].unique()
print("min:",min(feat_categories),"  max:",max(feat_categories))
print("length:", len(feat_categories))

min: 1   max: 73
length: 73

In [8]:
feat_values=features["feature_value_id"].unique()
print("min:",min(feat_values),"  max:",max(feat_values))
print("length:", len(feat_values))

min: 1   max: 905
length: 890

In [9]:
feat_category_count=features.groupby("feature_category_id")['value'].count()
feat_category_count # In how many items the feature is present

feature_category_id
1       941
2      2253
3      9311
4     14954
5      9488
      ...
69    20450
70      807
71      671
72    20499
73    13339
Name: value, Length: 73, dtype: int64

In [10]:
print("min:",min(feat_category_count),"  max:",max(feat_category_count))
print("length:", len(feat_category_count))

min: 1   max: 23691
length: 73

In [11]:
feat_category_count[feat_category_count<500] #features that appears in less than 500 items

feature_category_id
9     137
13    137
27      1
54    341
Name: value, dtype: int64

In [12]:
feat_category_count[feat_category_count>20000] # features that appears in more than 20000 items

feature_category_id
7     20416
47    23691
50    23077
56    23691
61    22512
68    23038
69    20450
72    20499
Name: value, dtype: int64

In [13]:
feats=features.groupby(["feature_category_id","feature_value_id"])["value"].count().reset_index()
feats # For the given feature category, how many items have the value specified in feature_value_id?

     feature_category_id  feature_value_id  value
0                      1                60      1
1                      1               143     10
2                      1               358      2
3                      1               461    924
4                      1               517      2
..                   ...               ...    ...
899                   72               751     55
900                   72               829    405
901                   72               883     65
902                   73                91   2381
903                   73               544  10958

[904 rows x 3 columns]

In [14]:
feats=feats.sort_values(by="value",ascending=False)
feats
feats.head()

     feature_category_id  feature_value_id  value
637                   56               365  19472
878                   72                75  12582
716                   61               706  12353
190                   17               378  11939
743                   63               861  11651

In [15]:
feats.tail()

     feature_category_id  feature_value_id  value
338                   30               641      1
351                   30               827      1
362                   31               306      1
375                   33               530      1
0                      1                60      1

In [16]:
feats=feats.reset_index()
feats["feature_idx"]=feats.index+1

In [17]:
feats

     index  feature_category_id  feature_value_id  value  feature_idx
0      637                   56               365  19472            1
1      878                   72                75  12582            2
2      716                   61               706  12353            3
3      190                   17               378  11939            4
4      743                   63               861  11651            5
..     ...                  ...               ...    ...          ...
899    338                   30               641      1          900
900    351                   30               827      1          901
901    362                   31               306      1          902
902    375                   33               530      1          903
903      0                    1                60      1          904

[904 rows x 5 columns]

In [18]:
feats[["feature_category_id","feature_value_id","feature_idx"]].to_csv(os.path.join(processed_data,"feature_mapped.csv"), index=False)

In [19]:
feats

     index  feature_category_id  feature_value_id  value  feature_idx
0      637                   56               365  19472            1
1      878                   72                75  12582            2
2      716                   61               706  12353            3
3      190                   17               378  11939            4
4      743                   63               861  11651            5
..     ...                  ...               ...    ...          ...
899    338                   30               641      1          900
900    351                   30               827      1          901
901    362                   31               306      1          902
902    375                   33               530      1          903
903      0                    1                60      1          904

[904 rows x 5 columns]

In [20]:
feats = feats[["feature_category_id","feature_value_id","feature_idx"]]

In [21]:
features_mapped=features.merge(feats,how="left",on=["feature_category_id","feature_value_id"])

In [22]:
features_mapped=features_mapped[["item_id","feature_idx"]]

In [23]:
features_mapped

        item_id  feature_idx
0         19021            1
1         19021           23
2         19021           16
3         19021          447
4         19021            2
...         ...          ...
471746    19020           16
471747    19020          363
471748    19020           75
471749    19020           46
471750    19020           17

[471751 rows x 2 columns]

In [24]:
features_mapped.to_csv(os.path.join(processed_data,"simplified_features.csv"),index=False)